# Bonus: Temperature Analysis I

In [1]:
#import dependancies
import pandas as pd
from datetime import datetime as dt
import scipy.stats as st

In [2]:
#import my CSV and dave it as a DataFrame Called DF
df = pd.read_csv('Data/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [3]:
# Convert the date column format from string to datetime
df['date'] = pd.to_datetime(df['date'])
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [4]:
# Set the date column as the DataFrame index
date_index = df.set_index('date')

In [5]:
df.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [6]:
# Drop the date column
date_drop = date_index.reset_index(drop = True)

In [7]:
date_drop.head()

       station  prcp  tobs
0  USC00519397  0.08    65
1  USC00519397  0.00    63
2  USC00519397  0.00    74
3  USC00519397  0.00    76
4  USC00519397   NaN    73

### Compare June and December data across all years

In [8]:
# Filter data for desired months
#To do so I seperated the month and the year from the date and stored them
#in another column I added to the DataFrame

#Figured out what lambda does. It is a way of applying a function to a column
#in a dataframe without having to write a defining name. Anonymous functions
#super handy for quick one time operations like this
df['month'] = df['date'].apply(lambda x: x.strftime('%m'))
df['year'] = df['date'].apply(lambda x: x.strftime('%y'))
df

           station       date  prcp  tobs month year
0      USC00519397 2010-01-01  0.08    65    01   10
1      USC00519397 2010-01-02  0.00    63    01   10
2      USC00519397 2010-01-03  0.00    74    01   10
3      USC00519397 2010-01-04  0.00    76    01   10
4      USC00519397 2010-01-06   NaN    73    01   10
...            ...        ...   ...   ...   ...  ...
19545  USC00516128 2017-08-19  0.09    71    08   17
19546  USC00516128 2017-08-20   NaN    78    08   17
19547  USC00516128 2017-08-21  0.56    76    08   17
19548  USC00516128 2017-08-22  0.50    76    08   17
19549  USC00516128 2017-08-23  0.45    76    08   17

[19550 rows x 6 columns]

In [9]:
# Identify the average temperature for June
#To filter the Month into a new dataaframe  I had to convert the month to an integer
df['month'] = df['month'].astype(int)
#created a new table for all rows the have month 6 which is june
june = df[df['month'] == 6]
#got the mean of all recordings in all years of June
average_june = june['tobs'].mean()

In [10]:
print('The average temperature recorded for all years in june is:')
print(f'{round(average_june, 1)}')

The average temperature recorded for all years in june is:
74.9

In [11]:
# Identify the average temperature for December
# Filtered Data by month 12 which is december and save it to ne table
dec = df[df['month'] == 12]
#got average temps in December across all values
average_dec = dec['tobs'].mean()

In [12]:
print('The average temperature recorded for all years in December is:')
print(f'{round(average_dec, 1)}')

The average temperature recorded for all years in December is:
71.0

In [13]:
# Tried to run a t tes buut june had 1700 recordings and dec had 1517
#dropped all NaN values and it got rid of most the excess data but june still had more
june = june.dropna()
#reset the index so I could drop the excess data by index
june_index= june.reset_index()
#dropped all data from row 1517 on
june_drop = june.drop(june.index[1517:],0)

In [14]:
#with same ammount of rows I was able to run a t test 
p_val, t_val = st.ttest_rel(june_drop['tobs'], dec['tobs'])
print('The P value for the relationship of June temps to December temps is:')
print(f'{p_val}')
print('The T value for the relationship of June temps to December temps is:')
print(f'{t_val}')

The P value for the relationship of June temps to December temps is:
32.04106957991016
The T value for the relationship of June temps to December temps is:
1.8765839401623292e-172

### Analysis

In [15]:
print('From our calculations of the T value and the Pvalue we can conclude that')
print('The temperature in June are directly related to the tempertur recordings in December')

From our calculations of the T value and the Pvalue we can conclude that
The temperature in June are directly related to the tempertur recordings in December